app/views/books/show.html.erb

			<li><strong>Category:</strong> <%= @book.category.name %></li>
			<li><strong>Author:</strong> <%= @book.author.first_name + ' ' + @book.author.last_name %></li>
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 2 LIMIT 1