app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Scott', 'Raymond', '2017-06-22 01:48:14', '2017-06-22 01:48:14')

  def edit
    @page_title = "Edit Author"
    @author = Author.find(params[:id])
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1

  def update
    @author = Author.find(params[:id])
    if @author.update(author_params)
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
UPDATE `authors` SET `first_name` = 'Scott 1', `last_name` = 'Raymond 1', `updated_at` = '2017-06-22 06:50:25' WHERE `authors`.`id` = 1

  def destroy
    @author = Author.find(params[:id])
    if @author.destroy
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 3

  def index
    @page_title = "All Author"
    @authors = Author.all
---
SELECT `authors`.* FROM `authors`