app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `isbn`, `year`, `price`, `buy`, `excerpt`, `format`, `pages`, `created_at`, `updated_at`, `coverpath`) VALUES ('Ruby On Rails Power', 1, 2, 2, '789674655', '2016', '7.11', 'http://www.ebay.com/itm/Ruby-on-Rails-Power-The-Comprehensive-Guide-ExLib-/262869524456?epid=50789121&hash=item3d343e9fe8:g:ulMAAOSwr~lYsVWX', 'Ruby on Rails Power!: The Comprehensive Guide\r\nby Bakharia, Aneesha\r\n\r\nEx-Library Book - will contain Library Markings. Book has a small amount of wear visible on the binding, cover, pages. Selection as wide as the Mississippi.', 'Paperback', 375, '2017-06-22 03:27:01', '2017-06-22 03:27:01', 'covers/ruby_on_rails_power.jpg')
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
UPDATE `books` SET `title` = 'PHP and MySQL', `updated_at` = '2017-06-22 04:35:58' WHERE `books`.`id` = 3
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
  def edit
    @page_title = "Edit Book"
    @book = Book.find(params[:id])

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 2
---
  def destroy
    @book = Book.find(params[:id])
    if @book.destroy

SELECT `books`.* FROM `books`
SELECT `categories`.* FROM `categories`
---
  def index
    @books = Book.all
    @categories = Category.all

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
---
  def show
    @book = Book.find(params[:id])
    @categories = Category.all