app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
---
  def edit
    @page_title = "Edit Category"
    @category = Category.find(params[:id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
UPDATE `categories` SET `name` = 'HTML 5', `updated_at` = '2017-06-22 06:36:47' WHERE `categories`.`id` = 2
---
  def update
    @category = Category.find(params[:id])
    if @category.update(category_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 5
---
  def destroy
    @category = Category.find(params[:id])
    if @category.destroy

SELECT `categories`.* FROM `categories`
---
  def index
    @page_title = "All Categories"
    @categories = Category.all

SELECT `categories`.* FROM `categories`
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @categories = Category.all
    @category = Category.find(params[:id])