app/controllers/publishers_controller.rb

  def create
    @publisher = Publisher.new(publisher_params)
    if @publisher.save
---
INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('O\'Reilly Media, Incorporated', '2017-06-22 02:44:11', '2017-06-22 02:44:11')

  def edit
    @page_title = "Edit Publisher"
    @publisher = Publisher.find(params[:id])
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 3 LIMIT 1

  def update
    @publisher = Publisher.find(params[:id])
    if @publisher.update(publisher_params)
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 3 LIMIT 1
UPDATE `publishers` SET `name` = 'test copy', `updated_at` = '2017-06-22 07:10:17' WHERE `publishers`.`id` = 3

  def destroy
    @publisher = Publisher.find(params[:id])
    if @publisher.destroy
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 3 LIMIT 1
DELETE FROM `publishers` WHERE `publishers`.`id` = 3

  def index
    @page_title = "All Publisher"
    @publishers = Publisher.all
---
SELECT `publishers`.* FROM `publishers`